# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. Пользователь в первой
# строке вводит натуральное число N – количество элементов в массиве. В последующих строках записаны N целых чисел
# Ai. Последняя строка содержит число X
#
# *Пример:*
# # 5
# 1 2 3 4 5
# 3
# -> 1

N = int(input('Введите количество элементов: '))
Ai = list(map(int, input().split()))
X = int(input('Введите искомый элемент: '))
count = 0
for i in range(N):
    if Ai[i] == X:
        count += 1
print(count)
